Documents/Лео_УстановкаСкидкиОтБазовыеЦены/Лео_УстановкаСкидкиОтБазовыеЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаСкидкиОтБазовыеЦены</name>
  <registerRecords>InformationRegister.Лео_СкидкиОтБазовыеЦены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>ДатаНачалаПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатуснаяСкидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяСкидка</name>
      <comment>Дополнительная скидка (за предоплату), (применяется последовательно 1.1.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусныйТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКомпенсирующаяПремию</name>
      <comment>Скидка, компенсирующая премию (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиЛогистики</name>
      <comment>Скидка за услуги логистики (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиТорговогоМаркетинга</name>
      <comment>Скидка за услуги торгового маркетинга (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиМерчендайзинга</name>
      <comment>Скидка за услуги мерчендайзинга (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаПрочиеУслугиПоДоговору</name>
      <comment>Скидка за прочие услуги по договору (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦенСоСкидкой</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУстановкаТиповЦенПоГруппам</name>
      <type>
        <types>DocumentRef.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздатьТипыЦен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздатьПривязкуТипаЦенКДоговору</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СпособыРасчетаЦены/СпособыРасчетаЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаЦены</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ПоПроцентнойНаценкеНаБазовыйТип</name>
  </enumValues>
  <enumValues>
    <name>ПоВхождениюБазовойЦеныВДиапазон</name>
  </enumValues>
</mdclass:Enum>

Enums/ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей/ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ПоЦеновымГруппам</name>
  </enumValues>
  <enumValues>
    <name>ПоНоменклатурнымГруппам</name>
  </enumValues>
  <enumValues>
    <name>абс_ПоДоговору</name>
  </enumValues>
</mdclass:Enum>

Documents/УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей/УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</name>
  <comment>(Упр)</comment>
  <registerRecords>InformationRegister.ТипыЦенПоГруппамНоменклатурыДляПокупателей</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатурныеЦеновыеГруппы</name>
    <attributes>
      <name>НоменклатурнаяЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/ТипыЦенНоменклатуры/ТипыЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦенНоменклатуры</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитывается</name>
    <comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>(Общ) Истина - цена включает НДС, ложь - не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <comment>(Общ) Истина, то при порядке округления &quot;5&quot; 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </attributes>
</mdclass:Catalog>

Documents/Лео_УстановкаСкидкиОтБазовыеЦены/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура СоздатьТипЦен(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала необходимо записать элемент справочника!");
		Возврат;
	КонецЕсли;

	Для каждого  СтрокаТч из  Объект.Скидки  Цикл
		Если СтрокаТч.СоздатьТипыЦен Тогда
			
			
			// 1.ТипЦенСоСкидкой
			ПроцентСкидкиНаценки = (100-(100-СтрокаТч.СтатуснаяСкидка)*((100-СтрокаТч.ДополнительнаяСкидка)/100));
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаКомпенсирующаяПремию; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиЛогистики; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиТорговогоМаркетинга; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиМерчендайзинга; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаПрочиеУслугиПоДоговору;
			//ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 2);
			ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 3);
			
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки *-1;
			
			БазовыйТипЦен = СтрокаТч.БазовыйТипЦен;
			Если ПроцентСкидкиНаценки <> 0 Тогда
				ТипЦен =  НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки);
			Иначе
				ТипЦен =  СтрокаТч.БазовыйТипЦен;
			КонецЕсли;
			
			
			Если ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Попытка
					ТипЦен = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
					ТипЦен.Наименование = "" + БазовыйТипЦен.Наименование + " " + ?(ПроцентСкидкиНаценки > 0,"+" + ПроцентСкидкиНаценки,ПроцентСкидкиНаценки)+ "%";
					ТипЦен.ВалютаЦены = БазовыйТипЦен.ВалютаЦены;
					ТипЦен.БазовыйТипЦен = БазовыйТипЦен;
					ТипЦен.Рассчитывается = Истина;
					ТипЦен.ПроцентСкидкиНаценки = ПроцентСкидкиНаценки;
					ТипЦен.ЦенаВключаетНДС = БазовыйТипЦен.ЦенаВключаетНДС;
					ТипЦен.ПорядокОкругления = БазовыйТипЦен.ПорядокОкругления;
					ТипЦен.ОкруглятьВБольшуюСторону = БазовыйТипЦен.ОкруглятьВБольшуюСторону;
	                ТипЦен.СпособРасчетаЦены = Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип;
					ТипЦен.Записать();
					
					Сообщить("Создан новый вид цен: " + ТипЦен);
				Исключение
					Сообщить("Не удалось создать тип цен");
                    Возврат
				КонецПопытки;
					
				СтрокаТч.ТипЦенСоСкидкой = 	ТипЦен.Ссылка;
			Иначе
				СтрокаТч.ТипЦенСоСкидкой = 	ТипЦен;
			КонецЕсли;
			
			// 2.СтатусныйТипЦен
			ПроцентСкидкиНаценки = (100-(100-СтрокаТч.СтатуснаяСкидка)*((100-СтрокаТч.ДополнительнаяСкидка)/100));
			ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 3);
			
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки *-1;
			
			БазовыйТипЦен = СтрокаТч.БазовыйТипЦен;
			Если ПроцентСкидкиНаценки <> 0 Тогда
				ТипЦен =  НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки);
			Иначе
				ТипЦен =  СтрокаТч.БазовыйТипЦен;
			КонецЕсли;
			
			
			Если ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Попытка
					ТипЦен = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
					ТипЦен.Наименование = "" + БазовыйТипЦен.Наименование + " " + ?(ПроцентСкидкиНаценки > 0,"+" + ПроцентСкидкиНаценки,ПроцентСкидкиНаценки)+ "%";
					ТипЦен.ВалютаЦены = БазовыйТипЦен.ВалютаЦены;
					ТипЦен.БазовыйТипЦен = БазовыйТипЦен;
					ТипЦен.Рассчитывается = Истина;
					ТипЦен.ПроцентСкидкиНаценки = ПроцентСкидкиНаценки;
					ТипЦен.ЦенаВключаетНДС = БазовыйТипЦен.ЦенаВключаетНДС;
					ТипЦен.ПорядокОкругления = БазовыйТипЦен.ПорядокОкругления;
					ТипЦен.ОкруглятьВБольшуюСторону = БазовыйТипЦен.ОкруглятьВБольшуюСторону;
	                ТипЦен.СпособРасчетаЦены = Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип;
					ТипЦен.Записать();
					
					Сообщить("Создан новый вид цен: " + ТипЦен);
				Исключение
					Сообщить("Не удалось создать тип цен");
                    Возврат
				КонецПопытки;
					
				СтрокаТч.СтатусныйТипЦен = 	ТипЦен.Ссылка;
			Иначе
				СтрокаТч.СтатусныйТипЦен = 	ТипЦен;
			КонецЕсли;
			
			
			
			
		КонецЕсли;
	КонецЦикла
КонецПроцедуры

Функция НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки)
	ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦен
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|ГДЕ
		|	ТипыЦенНоменклатуры.БазовыйТипЦен = &БазовыйТипЦен
		|	И ТипыЦенНоменклатуры.ПроцентСкидкиНаценки = &ПроцентСкидкиНаценки
		|	И ТипыЦенНоменклатуры.Рассчитывается = ИСТИНА
		|	И ТипыЦенНоменклатуры.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("БазовыйТипЦен", БазовыйТипЦен);
	Запрос.УстановитьПараметр("ПроцентСкидкиНаценки", ПроцентСкидкиНаценки);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипЦен = ВыборкаДетальныеЗаписи.ТипЦен; 
	КонецЦикла;
	
	Возврат ТипЦен
КонецФункции

&НаКлиенте
Процедура ПривязатьТипЦенКДоговору(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала необходимо записать элемент справочника!");
		Возврат;
	КонецЕсли;
	
	Для каждого  СтрокаТч из  Объект.Скидки  Цикл
		Если СтрокаТч.СоздатьПривязкуТипаЦенКДоговору  и СтрокаТч.ДокументУстановкаТиповЦенПоГруппам = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.ПустаяСсылка() Тогда
			Если СтрокаТч.ТипЦенСоСкидкой = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Сообщить ("Не указан тип цен с учетом скидки");
				Возврат
			КонецЕсли;
			
			РегистраторПривязки = ПривязатьТипЦенКДоговоруНаСервере(СтрокаТч.ТипЦенСоСкидкой,СтрокаТч.ДатаНачалаПериода,Объект.Договор);
			СтрокаТч.ДокументУстановкаТиповЦенПоГруппам = РегистраторПривязки;
			
    	КонецЕсли;
	КонецЦикла
КонецПроцедуры

Функция ПривязатьТипЦенКДоговоруНаСервере (ТипЦен,ДатаНачала,Договор)
	ДокументРегистратор = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.ПустаяСсылка();
	
	УстановкаТиповЦен = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.СоздатьДокумент();	
	УстановкаТиповЦен.Контрагент = Договор.Владелец;
    УстановкаТиповЦен.абс_ДоговорКонтрагента = Договор;
	УстановкаТиповЦен.Дата = ДатаНачала;
	УстановкаТиповЦен.ДатаНачала = ДатаНачала;
	УстановкаТиповЦен.ВидОперации = Перечисления.ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.абс_ПоДоговору;
	УстановкаТиповЦен.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	СтрокаТч = УстановкаТиповЦен.НоменклатурныеЦеновыеГруппы.Добавить();
	СтрокаТч.ТипЦен = ТипЦен;
	
	Попытка
  	 	УстановкаТиповЦен.Записать(РежимЗаписиДокумента.Проведение);
		ДокументРегистратор = УстановкаТиповЦен.Ссылка;
		Сообщить("Создан новый документ привязки типа цен к договору");
	Исключение
		Сообщить ("Не удалось провести документ привязки типа цен к договору.");
	КонецПопытки;

	Возврат ДокументРегистратор
КонецФункции

Функция ПолучитьДоступнуюРольИсполнителя(Роль) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Исполнитель = &Исполнитель
		|	И РолиИИсполнители.Роль = &Роль";
	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Роль", Роль);  
	Результат = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = Результат.Выбрать();  
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
    Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СкидкиСтатуснаяСкидкаПриИзменении(Элемент)
	
    Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СтатуснаяСкидка < -10 или ТекСтрока.СтатуснаяСкидка > 25 Тогда
		Сообщить("Значение не входит в диапазон значений от -10 до 25.");	
		ТекСтрока.СтатуснаяСкидка = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиДополнительнаяСкидкаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.ДополнительнаяСкидка < 0 или ТекСтрока.ДополнительнаяСкидка > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.ДополнительнаяСкидка = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаКомпенсирующаяПремиюПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаКомпенсирующаяПремию < 0 или ТекСтрока.СкидкаКомпенсирующаяПремию > 10 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 10.");	
		ТекСтрока.СкидкаКомпенсирующаяПремию = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиЛогистикиПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиЛогистики < -15 или ТекСтрока.СкидкаЗаУслугиЛогистики > 15 Тогда
		Сообщить("Значение не входит в диапазон значений от -15 до 15.");	
		ТекСтрока.СкидкаЗаУслугиЛогистики = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиТорговогоМаркетингаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга < 0 или ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга > 15 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 15.");	
		ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиМерчендайзингаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиМерчендайзинга < 0 или ТекСтрока.СкидкаЗаУслугиМерчендайзинга > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.СкидкаЗаУслугиМерчендайзинга = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаПрочиеУслугиПоДоговоруПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору < 0 или ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору = 0;
	КонецЕсли;
	
КонецПроцедуры
